{"CVE-2011-0104":{"Published":"2011-04-13T18:55:00","summary":"Microsoft Excel 2002 SP3 and 2003 SP3, Office 2004 and 2008 for Mac, and Open XML File Format Converter for Mac allow remote attackers to execute arbitrary code or cause a denial of service (memory corruption) via a crafted HLink record in an Excel file, aka \"Excel Buffer Overwrite Vulnerability.\""},"CVE-2011-0419":{"Published":"2011-05-16T17:55:00","summary":"Stack consumption vulnerability in the fnmatch implementation in apr_fnmatch.c in the Apache Portable Runtime (APR) library before 1.4.3 and the Apache HTTP Server before 2.2.18, and in fnmatch.c in libc in NetBSD 5.1, OpenBSD 4.8, FreeBSD, Apple Mac OS X 10.6, Oracle Solaris 10, and Android, allows context-dependent attackers to cause a denial of service (CPU and memory consumption) via *? sequences in the first argument, as demonstrated by attacks against mod_autoindex in httpd."},"CVE-2011-10001":{"Published":"2023-01-18T16:15:00","summary":"A vulnerability was found in iamdroppy phoenixcf. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file content/2-Community/articles.cfm. The manipulation leads to sql injection. The name of the patch is d156faf8bc36cd49c3b10d3697ef14167ad451d8. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-218491."},"CVE-2011-10002":{"Published":"2023-02-07T17:15:00","summary":"A vulnerability classified as critical has been found in weblabyrinth 0.3.1. This affects the function Labyrinth of the file labyrinth.inc.php. The manipulation leads to sql injection. Upgrading to version 0.3.2 is able to address this issue. The name of the patch is 60793fd8c8c4759596d3510641e96ea40e7f60e9. It is recommended to upgrade the affected component. The identifier VDB-220221 was assigned to this vulnerability."},"CVE-2011-1471":{"Published":"2011-03-20T02:00:00","summary":"Integer signedness error in zip_stream.c in the Zip extension in PHP before 5.3.6 allows context-dependent attackers to cause a denial of service (CPU consumption) via a malformed archive file that triggers errors in zip_fread function calls."},"CVE-2011-2487":{"Published":"2020-03-11T16:15:00","summary":"A flaw was found in JBoss web services where the services used a weak symmetric encryption protocol, PKCS#1 v1.5. An attacker could use this weakness in chosen-ciphertext attacks to recover the symmetric key and conduct further attacks."},"CVE-2011-2522":{"Published":"2011-07-29T20:55:00","summary":"Multiple cross-site request forgery (CSRF) vulnerabilities in the Samba Web Administration Tool (SWAT) in Samba 3.x before 3.5.10 allow remote attackers to hijack the authentication of administrators for requests that (1) shut down daemons, (2) start daemons, (3) add shares, (4) remove shares, (5) add printers, (6) remove printers, (7) add user accounts, or (8) remove user accounts, as demonstrated by certain start, stop, and restart parameters to the status program."},"CVE-2011-2523":{"Published":"2019-11-27T21:15:00","summary":"vsftpd 2.3.4 downloaded between 20110630 and 20110703 contains a backdoor which opens a shell on port 6200/tcp."},"CVE-2011-2906":{"Published":"2012-05-24T23:55:00","summary":"** DISPUTED ** Integer signedness error in the pmcraid_ioctl_passthrough function in drivers/scsi/pmcraid.c in the Linux kernel before 3.1 might allow local users to cause a denial of service (memory consumption or memory corruption) via a negative size value in an ioctl call. NOTE: this may be a vulnerability only in unusual environments that provide a privileged program for obtaining the required file descriptor."},"CVE-2011-2920":{"Published":"2014-02-05T18:55:00","summary":"CVE-2011-2920 Satellite: XSS flaw(s) in filter handling"},"CVE-2011-2927":{"Published":"2014-02-05T18:55:00","summary":"CVE-2011-2927 Satellite/Spacewalk: XSS flaw in channels search"},"CVE-2011-3192":{"Published":"2011-08-29T15:55:00","summary":"The byterange filter in the Apache HTTP Server 1.3.x, 2.0.x through 2.0.64, and 2.2.x through 2.2.19 allows remote attackers to cause a denial of service (memory and CPU consumption) via a Range header that expresses multiple overlapping ranges, as exploited in the wild in August 2011, a different vulnerability than CVE-2007-0086."},"CVE-2011-3344":{"Published":"2014-02-05T18:55:00","summary":"CVE-2011-3344 Satellite/Spacewalk: XSS on the Lost Password page"},"CVE-2011-3348":{"Published":"2011-09-20T05:55:00","summary":"The mod_proxy_ajp module in the Apache HTTP Server before 2.2.21, when used with mod_proxy_balancer in certain configurations, allows remote attackers to cause a denial of service (temporary \"error state\" in the backend server) via a malformed HTTP request."},"CVE-2011-3609":{"Published":"2019-11-26T03:15:00","summary":"CVE-2011-3609 JBoss AS: CSRF in the administration console \u0026 HTTP management API"},"CVE-2011-3640":{"Published":"2011-10-28T02:49:00","summary":"** DISPUTED ** Untrusted search path vulnerability in Mozilla Network Security Services (NSS), as used in Google Chrome before 17 on Windows and Mac OS X, might allow local users to gain privileges via a Trojan horse pkcs11.txt file in a top-level directory. NOTE: the vendor's response was \"Strange behavior, but we're not treating this as a security bug.\""},"CVE-2011-4084":{"Published":"2011-12-30T01:55:00","summary":"** REJECT ** DO NOT USE THIS CANDIDATE NUMBER. ConsultIDs: CVE-2011-4858. Reason: This candidate is a duplicate of CVE-2011-4858. Notes: All CVE users should reference CVE-2011-4858 instead of this candidate. All references and descriptions in this candidate have been removed to prevent accidental usage."},"CVE-2011-4127":{"Published":"2012-07-03T16:40:00","summary":"CVE-2011-4127 kernel: possible privilege escalation via SG_IO ioctl"},"CVE-2011-4566":{"Published":"2011-11-29T00:55:00","summary":"Integer overflow in the exif_process_IFD_TAG function in exif.c in the exif extension in PHP 5.4.0beta2 on 32-bit platforms allows remote attackers to read the contents of arbitrary memory locations or cause a denial of service via a crafted offset_val value in an EXIF header in a JPEG file, a different vulnerability than CVE-2011-0708."},"CVE-2011-5325":{"Published":"2017-08-07T17:29:00","summary":"Directory traversal vulnerability in the BusyBox implementation of tar before 1.22.0 v5 allows remote attackers to point to files outside the current working directory via a symlink."}}